### Pandas basics

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.Series(np.random.randn(5))

0    0.667176
1    0.029158
2   -0.877311
3   -0.001431
4    0.074574
dtype: float64

In [7]:
d={'a':1, 'b':2, 'c':3}
d=pd.Series(d)
print(d)

a    1
b    2
c    3
dtype: int64

In [8]:
d.dtype

dtype('int64')

In [11]:
d={
    "one":pd.Series([1,2,3,4,5]),
    'two':pd.Series([5,6,7,8,0])
}

df=pd.DataFrame(d)
print(df)

   one  two
0    1    5
1    2    6
2    3    7
3    4    8
4    5    0

In [13]:
d={
    "one":[1,2,3,4],
    "two":[5,6,7,8]
}

df=pd.DataFrame(d)
print(df)

   one  two
0    1    5
1    2    6
2    3    7
3    4    8

In [14]:
df.columns

Index(['one', 'two'], dtype='object')

In [17]:
data2=[{"a":1,"b":2},{"a":5,"b":10,"c":20}]
data2=pd.DataFrame(data2)

In [18]:
data2[["a","b"]]

   a   b
0  1   2
1  5  10

In [19]:
ser=pd.Series(range(3),name="ser")
ser=pd.DataFrame(ser)
ser

   ser
0    0
1    1
2    2

In [21]:
long_series=pd.Series(np.random.randn(1000))
print(long_series.head())
print(long_series.tail())

0    0.162123
1   -1.964647
2   -0.343654
3   -0.274528
4   -0.965258
dtype: float64
995    1.649149
996    1.245903
997    0.480838
998    0.211389
999    0.391535
dtype: float64

In [22]:
df= pd.DataFrame(
    {
        "one":pd.Series(np.random.randn(3)),
        "two":pd.Series(np.random.randn(4)),
        "three":pd.Series(np.random.randn(3))
    }
)
print(df)

        one       two     three
0  0.127862  0.900103  1.027582
1  1.358931  0.567895 -0.047917
2  0.801439  0.444854 -0.098605
3       NaN -1.858040       NaN

In [23]:
df.iloc[1]

one      1.358931
two      0.567895
three   -0.047917
Name: 1, dtype: float64

In [24]:
df["two"]

0    0.900103
1    0.567895
2    0.444854
3   -1.858040
Name: two, dtype: float64

In [26]:
col=df['two']
df.sub(col, axis="index")

        one  two     three
0 -0.772242  0.0  0.127478
1  0.791036  0.0 -0.615812
2  0.356585  0.0 -0.543460
3       NaN  0.0       NaN

In [27]:
(df>0).all()

one      False
two      False
three    False
dtype: bool

In [28]:
df.empty

False

In [30]:
df.mean(1)

0    0.685182
1    0.626303
2    0.382563
3   -1.858040
dtype: float64

In [31]:
df.sum(0, skipna=True)

one      2.288232
two      0.054813
three    0.881060
dtype: float64

In [33]:
df.describe()

            one       two     three
count  3.000000  4.000000  3.000000
mean   0.762744  0.013703  0.293687
std    0.616446  1.262557  0.636077
min    0.127862 -1.858040 -0.098605
25%    0.464650 -0.130869 -0.073261
50%    0.801439  0.506375 -0.047917
75%    1.080185  0.650947  0.489832
max    1.358931  0.900103  1.027582

In [34]:
data=np.random.randint(0,10,size=50)

In [35]:
s=pd.Series(data)
s.head()

0    8
1    5
2    0
3    5
4    3
dtype: int32

In [37]:
s.value_counts().sort_index()

0    4
1    3
2    3
3    7
4    4
5    8
6    4
7    2
8    6
9    9
Name: count, dtype: int64

In [38]:
s5=pd.Series([1,1,3,3,3,5,5,7,7,7])
s5.mode()

0    3
1    7
dtype: int64

In [40]:
df.apply(np.cumsum)

        one       two     three
0  0.127862  0.900103  1.027582
1  1.486793  1.467999  0.979665
2  2.288232  1.912853  0.881060
3       NaN  0.054813       NaN

In [41]:
df.apply("mean")

one      0.762744
two      0.013703
three    0.293687
dtype: float64

In [42]:
df.mean()

one      0.762744
two      0.013703
three    0.293687
dtype: float64

In [43]:
df.apply("mean", axis=1)

0    0.685182
1    0.626303
2    0.382563
3   -1.858040
dtype: float64

In [3]:
ser=pd.Series(range(5), index=list("abcde"))
print(ser)

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [4]:
ser.loc[["a", 'b']]

a    0
b    1
dtype: int64

In [5]:
df=pd.DataFrame(np.arange(25).reshape(5,5), index=list("abcde"), columns=list("abcde"))
print(df)

    a   b   c   d   e
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19
e  20  21  22  23  24

In [6]:
df.loc[["a","b","c"]]

    a   b   c   d   e
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14

In [7]:
df.loc[["a","b","c"],["b","d"]]

    b   d
a   1   3
b   6   8
c  11  13

In [8]:
dates=pd.date_range('1/1/2000', periods=8)
df= pd.DataFrame(np.random.randn(8,4),
                 index=dates, columns=['A', 'B','C', 'D'])
df

                   A         B         C         D
2000-01-01 -0.369812  1.112446  0.077792  0.895914
2000-01-02 -1.038972  1.357381 -0.160671  0.098188
2000-01-03  0.037776 -1.982405  0.332962 -0.699513
2000-01-04  0.722556  1.581550  0.637607  0.048642
2000-01-05 -0.381097  1.019708  0.666692  2.136263
2000-01-06  0.452302 -0.412611 -0.224727  0.739594
2000-01-07 -0.925517 -0.436363 -0.437983 -0.275917
2000-01-08 -0.862351  1.609377 -1.651750  1.809911

In [9]:
df['A']

2000-01-01   -0.369812
2000-01-02   -1.038972
2000-01-03    0.037776
2000-01-04    0.722556
2000-01-05   -0.381097
2000-01-06    0.452302
2000-01-07   -0.925517
2000-01-08   -0.862351
Freq: D, Name: A, dtype: float64

In [10]:
df[["B","A"]]=df[["A","B"]]

In [11]:
df

                   A         B         C         D
2000-01-01  1.112446 -0.369812  0.077792  0.895914
2000-01-02  1.357381 -1.038972 -0.160671  0.098188
2000-01-03 -1.982405  0.037776  0.332962 -0.699513
2000-01-04  1.581550  0.722556  0.637607  0.048642
2000-01-05  1.019708 -0.381097  0.666692  2.136263
2000-01-06 -0.412611  0.452302 -0.224727  0.739594
2000-01-07 -0.436363 -0.925517 -0.437983 -0.275917
2000-01-08  1.609377 -0.862351 -1.651750  1.809911

In [12]:
df[["A","B"]]

                   A         B
2000-01-01  1.112446 -0.369812
2000-01-02  1.357381 -1.038972
2000-01-03 -1.982405  0.037776
2000-01-04  1.581550  0.722556
2000-01-05  1.019708 -0.381097
2000-01-06 -0.412611  0.452302
2000-01-07 -0.436363 -0.925517
2000-01-08  1.609377 -0.862351

In [13]:
df.loc[:,["B","A"]]=df[["A","B"]]
df[["A","B"]]

                   A         B
2000-01-01  1.112446 -0.369812
2000-01-02  1.357381 -1.038972
2000-01-03 -1.982405  0.037776
2000-01-04  1.581550  0.722556
2000-01-05  1.019708 -0.381097
2000-01-06 -0.412611  0.452302
2000-01-07 -0.436363 -0.925517
2000-01-08  1.609377 -0.862351

In [14]:
df.loc[:,["B","A"]]=df[["A","B"]].to_numpy()
df[["A","B"]]

                   A         B
2000-01-01 -0.369812  1.112446
2000-01-02 -1.038972  1.357381
2000-01-03  0.037776 -1.982405
2000-01-04  0.722556  1.581550
2000-01-05 -0.381097  1.019708
2000-01-06  0.452302 -0.412611
2000-01-07 -0.925517 -0.436363
2000-01-08 -0.862351  1.609377

In [17]:
df.iloc[:, [0,1]]

                   A         B
2000-01-01 -0.369812  1.112446
2000-01-02 -1.038972  1.357381
2000-01-03  0.037776 -1.982405
2000-01-04  0.722556  1.581550
2000-01-05 -0.381097  1.019708
2000-01-06  0.452302 -0.412611
2000-01-07 -0.925517 -0.436363
2000-01-08 -0.862351  1.609377

In [18]:
df.iloc[:,[1,0]]=df[["A","B"]]
df[["A", "B"]]

                   A         B
2000-01-01  1.112446 -0.369812
2000-01-02  1.357381 -1.038972
2000-01-03 -1.982405  0.037776
2000-01-04  1.581550  0.722556
2000-01-05  1.019708 -0.381097
2000-01-06 -0.412611  0.452302
2000-01-07 -0.436363 -0.925517
2000-01-08  1.609377 -0.862351

In [19]:
dfa=df.copy()

In [20]:
dfa.A

2000-01-01    1.112446
2000-01-02    1.357381
2000-01-03   -1.982405
2000-01-04    1.581550
2000-01-05    1.019708
2000-01-06   -0.412611
2000-01-07   -0.436363
2000-01-08    1.609377
Freq: D, Name: A, dtype: float64

In [22]:
x=pd.DataFrame({'x':[1,2,3],'y':[3,4,5]})

In [23]:
x.iloc[1]={'x':9, 'y':99}

In [24]:
x

   x   y
0  1   3
1  9  99
2  3   5

In [25]:
df1=pd.DataFrame(np.random.randn(5,4),
                 columns=list('ABCD'))
df1

          A         B         C         D
0  0.724374  2.481409 -0.908904 -0.177923
1 -0.817959 -0.516817  0.567020  0.915322
2  0.189909  0.484638 -1.724778 -0.158015
3  2.560256  1.512477 -0.317522  0.374679
4 -1.172405  1.629811 -0.320174  0.663295

In [26]:
df1.loc[2:3]

          A         B         C         D
2  0.189909  0.484638 -1.724778 -0.158015
3  2.560256  1.512477 -0.317522  0.374679

In [27]:
df1.iloc[2:3]

          A         B         C         D
2  0.189909  0.484638 -1.724778 -0.158015

In [28]:
df1=pd.DataFrame(np.random.randn(6,4),
                 columns=list('ABCD'))

In [30]:
df1.loc[:,'A']

0   -0.935072
1    0.068191
2    0.800036
3   -0.398361
4   -0.039319
5    0.978752
Name: A, dtype: float64

In [31]:
df1.iloc[:,0]

0   -0.935072
1    0.068191
2    0.800036
3   -0.398361
4   -0.039319
5    0.978752
Name: A, dtype: float64

In [32]:
df1.loc[lambda df:df["A"]>0,:]

          A         B         C         D
1  0.068191  1.233150 -1.383937 -0.551224
2  0.800036  1.891470 -0.198137 -1.291126
5  0.978752  0.192075 -0.671211  1.535948

In [39]:
df1.iloc[:,lambda df:[0,1]]

          A         B
0 -0.935072  1.792251
1  0.068191  1.233150
2  0.800036  1.891470
3 -0.398361  0.382846
4 -0.039319 -0.518009
5  0.978752  0.192075

In [40]:
df1['A'].loc[lambda s:s>0]

1    0.068191
2    0.800036
5    0.978752
Name: A, dtype: float64

In [41]:
dfi=pd.DataFrame(np.random.randn(6).reshape(3,2),
                 columns=['A','B'])
dfi

          A         B
0  1.201326  0.157173
1 -0.975199 -0.498893
2 -0.345524 -0.643859

In [42]:
dfi.loc[:,'C']=dfi.loc[:,"A"]

In [43]:
dfi

          A         B         C
0  1.201326  0.157173  1.201326
1 -0.975199 -0.498893 -0.975199
2 -0.345524 -0.643859 -0.345524

In [44]:
dfi['D']=dfi['B']
dfi

          A         B         C         D
0  1.201326  0.157173  1.201326  0.157173
1 -0.975199 -0.498893 -0.975199 -0.498893
2 -0.345524 -0.643859 -0.345524 -0.643859

In [45]:
df1[df1['A']>0]

          A         B         C         D
1  0.068191  1.233150 -1.383937 -0.551224
2  0.800036  1.891470 -0.198137 -1.291126
5  0.978752  0.192075 -0.671211  1.535948

In [46]:
df.where(df<0)

                   A         B         C         D
2000-01-01       NaN -0.369812       NaN       NaN
2000-01-02       NaN -1.038972 -0.160671       NaN
2000-01-03 -1.982405       NaN       NaN -0.699513
2000-01-04       NaN       NaN       NaN       NaN
2000-01-05       NaN -0.381097       NaN       NaN
2000-01-06 -0.412611       NaN -0.224727       NaN
2000-01-07 -0.436363 -0.925517 -0.437983 -0.275917
2000-01-08       NaN -0.862351 -1.651750       NaN

In [47]:
df.where(df<0, -df)

                   A         B         C         D
2000-01-01 -1.112446 -0.369812 -0.077792 -0.895914
2000-01-02 -1.357381 -1.038972 -0.160671 -0.098188
2000-01-03 -1.982405 -0.037776 -0.332962 -0.699513
2000-01-04 -1.581550 -0.722556 -0.637607 -0.048642
2000-01-05 -1.019708 -0.381097 -0.666692 -2.136263
2000-01-06 -0.412611 -0.452302 -0.224727 -0.739594
2000-01-07 -0.436363 -0.925517 -0.437983 -0.275917
2000-01-08 -1.609377 -0.862351 -1.651750 -1.809911

In [48]:
df2=df.copy()

In [50]:
df2[df2[1:4]>0]=3
df2

                   A         B         C         D
2000-01-01  1.112446 -0.369812  0.077792  0.895914
2000-01-02  3.000000 -1.038972 -0.160671  3.000000
2000-01-03 -1.982405  3.000000  3.000000 -0.699513
2000-01-04  3.000000  3.000000  3.000000  3.000000
2000-01-05  1.019708 -0.381097  0.666692  2.136263
2000-01-06 -0.412611  0.452302 -0.224727  0.739594
2000-01-07 -0.436363 -0.925517 -0.437983 -0.275917
2000-01-08  1.609377 -0.862351 -1.651750  1.809911

In [3]:
df=pd.DataFrame({'a':list('aabbccddeeff'),'b':list('aaaabbbbcccc'),
                 'c':np.random.randint(5, size=12),
                 'd': np.random.randint(9, size=12)})
df

    a  b  c  d
0   a  a  1  6
1   a  a  0  2
2   b  a  2  5
3   b  a  0  6
4   c  b  3  6
5   c  b  4  3
6   d  b  0  0
7   d  b  1  0
8   e  c  3  4
9   e  c  1  0
10  f  c  1  2
11  f  c  3  2

In [4]:
df.query('a in b')

   a  b  c  d
0  a  a  1  6
1  a  a  0  2
2  b  a  2  5
3  b  a  0  6
4  c  b  3  6
5  c  b  4  3

In [5]:
df[df['a'].isin(df['b'])]

   a  b  c  d
0  a  a  1  6
1  a  a  0  2
2  b  a  2  5
3  b  a  0  6
4  c  b  3  6
5  c  b  4  3

In [6]:
df[~df['a'].isin(df[df['b']])]

    a  b  c  d
6   d  b  0  0
7   d  b  1  0
8   e  c  3  4
9   e  c  1  0
10  f  c  1  2
11  f  c  3  2

In [9]:
df[df['b'].isin(df['a']) & (df['c']<df['d'])]

    a  b  c  d
0   a  a  1  6
1   a  a  0  2
2   b  a  2  5
3   b  a  0  6
4   c  b  3  6
8   e  c  3  4
10  f  c  1  2

In [10]:
df2=pd.DataFrame({'a':['one', 'one','two','two','two','three','four'],
                  'b': ['x', 'y', 'x', 'y', 'x', 'x', 'x'],
                  'c': np.random.randn(7)})
df2

       a  b         c
0    one  x  1.351982
1    one  y -0.418364
2    two  x  0.835740
3    two  y  1.307078
4    two  x  0.430061
5  three  x  0.440332
6   four  x  0.247934

In [11]:
df2.duplicated('a')

0    False
1     True
2    False
3     True
4     True
5    False
6    False
dtype: bool

In [12]:
df2.duplicated('a', keep='last')

0     True
1    False
2     True
3     True
4    False
5    False
6    False
dtype: bool

In [13]:
df2.duplicated('a', keep=False)

0     True
1     True
2     True
3     True
4     True
5    False
6    False
dtype: bool

In [14]:
df2.drop_duplicates('a', keep='last')

       a  b         c
1    one  y -0.418364
4    two  x  0.430061
5  three  x  0.440332
6   four  x  0.247934

In [15]:
df2.drop_duplicates('a', keep=False)

       a  b         c
5  three  x  0.440332
6   four  x  0.247934

In [16]:
df3 = pd.DataFrame({'a': np.arange(6),
                    'b': np.random.randn(6)},
                   index=['a', 'a', 'b', 'c', 'b', 'a'])
df3

   a         b
a  0 -1.020284
a  1  1.472382
b  2 -1.083769
c  3  1.662178
b  4  0.953357
a  5 -2.666856

In [17]:
df3.index.duplicated()

array([False,  True, False, False,  True,  True])

In [18]:
df3[~df3.index.duplicated()]

   a         b
a  0 -1.020284
b  2 -1.083769
c  3  1.662178

In [19]:
df3[~df3.index.duplicated(keep='last')]

   a         b
c  3  1.662178
b  4  0.953357
a  5 -2.666856

In [20]:
data = pd.DataFrame({'a': ['bar', 'bar', 'foo', 'foo'],
                     'b': ['one', 'two', 'one', 'two'],
                     'c': ['z', 'y', 'x', 'w'],
                     'd': [1., 2., 3, 4]})

data

     a    b  c    d
0  bar  one  z  1.0
1  bar  two  y  2.0
2  foo  one  x  3.0
3  foo  two  w  4.0

In [21]:
index1=data.set_index('c')

In [22]:
index1

     a    b    d
c
z  bar  one  1.0
y  bar  two  2.0
x  foo  one  3.0
w  foo  two  4.0

In [23]:
index2=data.set_index(['a','b'])
index2

         c    d
a   b
bar one  z  1.0
    two  y  2.0
foo one  x  3.0
    two  w  4.0

In [24]:
data

     a    b  c    d
0  bar  one  z  1.0
1  bar  two  y  2.0
2  foo  one  x  3.0
3  foo  two  w  4.0

In [25]:
data.reset_index()

   index    a    b  c    d
0      0  bar  one  z  1.0
1      1  bar  two  y  2.0
2      2  foo  one  x  3.0
3      3  foo  two  w  4.0

In [26]:
data.reset_index(level=1)

IndexError: Too many levels: Index has only 1 level, not 2

### Multiindex

In [27]:
arrays = [
    ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
    ["one", "two", "one", "two", "one", "two", "one", "two"],
]

In [28]:
arrays

[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
 ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]

In [29]:
tuples=list(zip(*arrays))

In [30]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [31]:
df=pd.DataFrame({"foo":[1,2,3],
                 "bar":[4,5,6]})
df

   foo  bar
0    1    4
1    2    5
2    3    6

In [32]:
df['foo']=df['foo'].replace(1,5)

In [33]:
df

   foo  bar
0    5    4
1    2    5
2    3    6

### Merge, join, concatenate and compare

In [34]:
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)
df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[4, 5, 6, 7],
)
df3 = pd.DataFrame(
    {
        "A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"],
    },
    index=[8, 9, 10, 11],
)

frames=[df1,df2,df3]
result=pd.concat(frames)

In [35]:
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [36]:
df4 = pd.DataFrame(
    {
        "B": ["B2", "B3", "B6", "B7"],
        "D": ["D2", "D3", "D6", "D7"],
        "F": ["F2", "F3", "F6", "F7"],
    },
    index=[2, 3, 6, 7],
)

In [37]:
result=pd.concat([df1, df4], axis=1)

In [38]:
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [43]:
result2=pd.concat([df1, df4], axis=0)

In [44]:
result2

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [45]:
result=pd.concat([df1, df4], axis=1, join='inner')
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [46]:
left = pd.DataFrame(
    {
        "key": ["K0", "K1", "K2", "K3"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)
right = pd.DataFrame(
    {
        "key": ["K0", "K1", "K2", "K3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    }
)

result=pd.merge(left, right, on='key')
result

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [2]:
left = pd.DataFrame(
   {
      "key1": ["K0", "K0", "K1", "K2"],
      "key2": ["K0", "K1", "K0", "K1"],
      "A": ["A0", "A1", "A2", "A3"],
      "B": ["B0", "B1", "B2", "B3"],
   }
)
right = pd.DataFrame(
   {
      "key1": ["K0", "K1", "K1", "K2"],
      "key2": ["K0", "K0", "K0", "K0"],
      "C": ["C0", "C1", "C2", "C3"],
      "D": ["D0", "D1", "D2", "D3"],
   }
)


result=pd.merge(left, right, how='left', on=['key1','key2'])
result

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [3]:
result2=pd.merge(left, right, how='right', on=['key1', 'key2'])
result2

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [49]:
result3=pd.merge(left, right, how='inner', on=['key1', 'key2'])

In [50]:
result3

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [5]:
left = pd.DataFrame(
    {"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"]
)
right = pd.DataFrame(
    {"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=["K0", "K2", "K3"]
)

result=left.join(right)
result

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [6]:
result=left.join(right, how='inner')
result

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

### Reshaping and Pivoting

In [7]:
data = {
   "value": range(12),
   "variable": ["A"] * 3 + ["B"] * 3 + ["C"] * 3 + ["D"] * 3,
   "date": pd.to_datetime(["2020-01-03", "2020-01-04", "2020-01-05"] * 4)
}


df = pd.DataFrame(data)

In [8]:
df

    value variable       date
0       0        A 2020-01-03
1       1        A 2020-01-04
2       2        A 2020-01-05
3       3        B 2020-01-03
4       4        B 2020-01-04
5       5        B 2020-01-05
6       6        C 2020-01-03
7       7        C 2020-01-04
8       8        C 2020-01-05
9       9        D 2020-01-03
10     10        D 2020-01-04
11     11        D 2020-01-05

In [9]:
pivoted=df.pivot(index='date', columns='variable', values='value')
pivoted

variable    A  B  C   D
date
2020-01-03  0  3  6   9
2020-01-04  1  4  7  10
2020-01-05  2  5  8  11

In [10]:
import datetime

df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 6,
        "B": ["A", "B", "C"] * 8,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 4,
        "D": np.random.randn(24),
        "E": np.random.randn(24),
        "F": [datetime.datetime(2013, i, 1) for i in range(1, 13)]
        + [datetime.datetime(2013, i, 15) for i in range(1, 13)],
    }
)


df

        A  B    C         D         E          F
0     one  A  foo  0.232993 -0.234317 2013-01-01
1     one  B  foo -0.010426  2.077817 2013-02-01
2     two  C  foo -1.061728 -1.020907 2013-03-01
3   three  A  bar -1.248444  0.493140 2013-04-01
4     one  B  bar -0.188012  0.229270 2013-05-01
5     one  C  bar  1.047234 -0.247160 2013-06-01
6     two  A  foo  0.273736  0.162051 2013-07-01
7   three  B  foo  1.798863 -0.194748 2013-08-01
8     one  C  foo  0.144110 -0.368217 2013-09-01
9     one  A  bar  0.034861 -0.686133 2013-10-01
10    two  B  bar  1.540754  0.056295 2013-11-01
11  three  C  bar  0.047493 -1.234708 2013-12-01
12    one  A  foo  0.183191 -0.727919 2013-01-15
13    one  B  foo  1.637065  0.428253 2013-02-15
14    two  C  foo  0.140439  0.319437 2013-03-15
15  three  A  bar  1.558743 -1.272109 2013-04-15
16    one  B  bar  1.567936  0.239557 2013-05-15
17    one  C  bar  1.434499  0.165143 2013-06-15
18    two  A  foo -1.207801  0.817050 2013-07-15
19  three  B  foo -0.407168  0.127724 2013-08-15
20    one  C  foo -0.497050  0.802786 2013-09-15
21    one  A  bar -1.454090 -0.451057 2013-10-15
22    two  B  bar -1.359948 -0.672752 2013-11-15
23  three  C  bar -0.393574  1.125078 2013-12-15

In [11]:
pd.pivot_table(df,values='D', index=['A','B'], columns=['C'])

C             bar       foo
A     B
one   A -0.709614  0.208092
      B  0.689962  0.813319
      C  1.240867 -0.176470
three A  0.155149       NaN
      B       NaN  0.695847
      C -0.173041       NaN
two   A       NaN -0.467033
      B  0.090403       NaN
      C       NaN -0.460644

In [12]:
cheese = pd.DataFrame(
    {
        "first": ["John", "Mary"],
        "last": ["Doe", "Bo"],
        "height": [5.5, 6.0],
        "weight": [130, 150],
    }
)


cheese

  first last  height  weight
0  John  Doe     5.5     130
1  Mary   Bo     6.0     150

In [13]:
cheese.melt(id_vars=['first','last'])

  first last variable  value
0  John  Doe   height    5.5
1  Mary   Bo   height    6.0
2  John  Doe   weight  130.0
3  Mary   Bo   weight  150.0

In [14]:
df = pd.DataFrame({"key": list("bbacab"), "data1": range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [15]:
pd.get_dummies(df['key'])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [16]:
df['key'].str.get_dummies()

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [17]:
df = pd.DataFrame(
    {"A": [1, 2, 2, 2, 2], "B": [3, 3, 4, 4, 4], "C": [1, 1, np.nan, 1, 1]}
)


df

   A  B    C
0  1  3  1.0
1  2  3  1.0
2  2  4  NaN
3  2  4  1.0
4  2  4  1.0

In [18]:
pd.crosstab(df['A'],df['B'], normalize=True)

B    3    4
A
1  0.2  0.0
2  0.2  0.6

In [19]:
x = pd.Series(["A", "A", np.nan, "B", 3.14, np.inf])

x

0       A
1       A
2     NaN
3       B
4    3.14
5     inf
dtype: object

In [20]:
labels, unique=pd.factorize(x)

print(labels)

unique

[ 0  0 -1  1  2  3]

Index(['A', 'B', 3.14, inf], dtype='object')

In [21]:
s=pd.Series(['a', 'b','c'])
s

0    a
1    b
2    c
dtype: object

In [22]:
s.astype('string')

0    a
1    b
2    c
dtype: string

In [23]:
s = pd.Series(
    ["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"], dtype="string"
)

In [24]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5    <NA>
6    caba
7     dog
8     cat
dtype: string

In [26]:
s.str.upper()

0       A
1       B
2       C
3    AABA
4    BACA
5    <NA>
6    CABA
7     DOG
8     CAT
dtype: string

In [27]:
s.str.len()

0       1
1       1
2       1
3       4
4       4
5    <NA>
6       4
7       3
8       3
dtype: Int64

In [28]:
idx=pd.Series([" jack", "jill ", " jesse ", "frank"])
idx.str.strip()

0     jack
1     jill
2    jesse
3    frank
dtype: object

In [29]:
idx.str.lstrip()

0      jack
1     jill
2    jesse
3     frank
dtype: object

In [30]:
s2 = pd.Series(["a_b_c", "c_d_e", np.nan, "f_g_h"], dtype="string")
s2.str.split('_')

0    [a, b, c]
1    [c, d, e]
2         <NA>
3    [f, g, h]
dtype: object

In [31]:
s = pd.Series(["a", "b", "c", "d"], dtype="string")
s.str.cat()

'abcd'

In [33]:
s.str.cat(sep='_')

'a_b_c_d'

In [34]:
df = pd.DataFrame([[np.nan, 1, 2], [1, 2, np.nan], [1, 2, 3]])

In [35]:
df

     0  1    2
0  NaN  1  2.0
1  1.0  2  NaN
2  1.0  2  3.0

In [36]:
df.dropna()

     0  1    2
2  1.0  2  3.0

In [37]:
df.fillna(0)

     0  1    2
0  0.0  1  2.0
1  1.0  2  0.0
2  1.0  2  3.0

In [38]:
df.ffill()

     0  1    2
0  NaN  1  2.0
1  1.0  2  2.0
2  1.0  2  3.0

In [39]:
df.bfill()

     0  1    2
0  1.0  1  2.0
1  1.0  2  3.0
2  1.0  2  3.0

In [40]:
dff = pd.DataFrame(np.arange(30, dtype=np.float64).reshape(10, 3), columns=list("ABC"))
dff

      A     B     C
0   0.0   1.0   2.0
1   3.0   4.0   5.0
2   6.0   7.0   8.0
3   9.0  10.0  11.0
4  12.0  13.0  14.0
5  15.0  16.0  17.0
6  18.0  19.0  20.0
7  21.0  22.0  23.0
8  24.0  25.0  26.0
9  27.0  28.0  29.0

In [41]:
dff.iloc[3:5,0]=np.nan
dff.iloc[4:6,1]=np.nan
dff.iloc[5:8, 2]=np.nan

In [42]:
dff

      A     B     C
0   0.0   1.0   2.0
1   3.0   4.0   5.0
2   6.0   7.0   8.0
3   NaN  10.0  11.0
4   NaN   NaN  14.0
5  15.0   NaN   NaN
6  18.0  19.0   NaN
7  21.0  22.0   NaN
8  24.0  25.0  26.0
9  27.0  28.0  29.0

In [43]:
dff.fillna(dff.mean())

       A     B          C
0   0.00   1.0   2.000000
1   3.00   4.0   5.000000
2   6.00   7.0   8.000000
3  14.25  10.0  11.000000
4  14.25  14.5  14.000000
5  15.00  14.5  13.571429
6  18.00  19.0  13.571429
7  21.00  22.0  13.571429
8  24.00  25.0  26.000000
9  27.00  28.0  29.000000

In [44]:
df = pd.DataFrame(
    {
        "A": [1, 2.1, np.nan, 4.7, 5.6, 6.8],
        "B": [0.25, np.nan, np.nan, 4, 12.2, 14.4],
    }
)

In [45]:
df

     A      B
0  1.0   0.25
1  2.1    NaN
2  NaN    NaN
3  4.7   4.00
4  5.6  12.20
5  6.8  14.40

In [46]:
df.interpolate()

     A      B
0  1.0   0.25
1  2.1   1.50
2  3.4   2.75
3  4.7   4.00
4  5.6  12.20
5  6.8  14.40

In [47]:
df = pd.DataFrame(np.eye(3))

In [48]:
df_missing=df.replace(0, np.nan)

In [49]:
df_filled=df_missing.replace(np.nan,2)
df_filled

     0    1    2
0  1.0  2.0  2.0
1  2.0  1.0  2.0
2  2.0  2.0  1.0